docs/leets/1302-Deepest-Leaves-Sum.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-07-08 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
<link rel="stylesheet" href="/static/highlightjs/styles/base16/green-screen.min.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 
</div>
<div id="content" class="content">
<div id="outline-container-org93e4cd7" class="outline-2">
<h2 id="org93e4cd7">1302. Deepest Leaves Sum</h2>
<div class="outline-text-2" id="text-org93e4cd7">
</div>
</div>

<div id="outline-container-org9d42708" class="outline-2">
<h2 id="org9d42708">Problem:</h2>
<div class="outline-text-2" id="text-org9d42708">
<p>
The goal is to find the sum of the values of the deepest leaves in a binary tree. A leaf is a node with no children, and the deepest leaves are those at the maximum depth of the tree.
</p>
</div>
</div>

<div id="outline-container-orgdebd413" class="outline-2">
<h2 id="orgdebd413">Solution Description:</h2>
<div class="outline-text-2" id="text-orgdebd413">
<p>
To implement a solution for summing the values of the deepest leaves, we need to perform the following steps:
</p>
<ol class="org-ol">
<li>Use Breadth-First Search (BFS) to traverse the tree level by level.</li>
<li>Keep track of the nodes at each level and their corresponding depth.</li>
<li>Once the traversal completes, sum the values of the deepest level nodes.</li>
</ol>

<p>
The BFS approach ensures that when we reach the deepest level nodes, we will have the necessary information to sum their values efficiently.
</p>
</div>

<div id="outline-container-org6a7d673" class="outline-3">
<h3 id="org6a7d673">Time Complexity:</h3>
<div class="outline-text-3" id="text-org6a7d673">
<p>
The time complexity is O(N), where N is the number of nodes in the binary tree, as we need to visit each node exactly once.
</p>
</div>
</div>

<div id="outline-container-org02cc6ed" class="outline-3">
<h3 id="org02cc6ed">Space Complexity:</h3>
<div class="outline-text-3" id="text-org02cc6ed">
<p>
The space complexity is O(M), where M is the maximum number of nodes at any one level (the width of the tree).
</p>
</div>
</div>
</div>

<div id="outline-container-orgef8849f" class="outline-2">
<h2 id="orgef8849f">Example:</h2>
<div class="outline-text-2" id="text-orgef8849f">
<p>
Consider the following binary tree:
```
         1
       /   \
      2     3
     / \     \
    4   5     6
   /         / \
  7         8   9
```
</p>
<ul class="org-ul">
<li>The deepest leaves are 7, 8, and 9.</li>
<li>Their sum is 7 + 8 + 9 = 24.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd03d2c7" class="outline-2">
<h2 id="orgd03d2c7">Setup:</h2>
<div class="outline-text-2" id="text-orgd03d2c7">
<p>
The solution will be implemented in JavaScript using modern JS syntax. The testing setup will use `console.log` statements to verify the results.
</p>
</div>
</div>

<div id="outline-container-org423d7f9" class="outline-2">
<h2 id="org423d7f9">Plan:</h2>
<div class="outline-text-2" id="text-org423d7f9">
<ol class="org-ol">
<li>Create a function to traverse the tree using BFS.</li>
<li>Keep track of the deepest level and sum the values of the leaves at this level.</li>
<li>Return the sum of the deepest leaves.</li>
</ol>

<div class="org-src-container">
<pre class="src src-js">// Helper function declarations to avoid issues in some environments.

function TreeNode(val, left, right) {
      this.val = (val===undefined ? 0 : val)
      this.left = (left===undefined ? null : left)
      this.right = (right===undefined ? null : right)
}


/**
 * Definition for a binary tree node.
 * function TreeNode(val, left, right) {
 *     this.val = (val===undefined ? 0 : val)
 *     this.left = (left===undefined ? null : left)
 *     this.right = (right===undefined ? null : right)
 * }
 */

/**
 * Main function to find the sum of the deepest leaves of a binary tree.
 * @param {TreeNode} root - The root of the binary tree.
 * @returns {number} - The sum of the values of the deepest leaves.
 */
function deepestLeavesSum(root) {
    // Placeholder return statement.
    const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
    const table = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.table;

    const sum = {
        val: 0,
        level: 0
    };
    if (!root) return 0;

    const q = [ [root, 0] ];
    while (q.length &gt; 0) {
        const x = q.shift();

        //log("x", x);

        const [node, level] = x;

        if (node.left) {
            q.push([node.left, level + 1]);
        }
        if (node.right) {
            q.push([node.right, level + 1]);
        }

        if (sum.level === level) {
            sum.val += node.val;
        } else if (sum.level &lt; level) {
            sum.val = node.val;
            sum.level = level
        }
    }

    return sum.val;
}

// Example test cases
const testCases = [
    {
        root: new TreeNode(1, 
             new TreeNode(2, 
                 new TreeNode(4, 
                     new TreeNode(7)), 
                     new TreeNode(5)), 
             new TreeNode(3, 
                 null, 
                 new TreeNode(6, 
                     new TreeNode(8), 
                     new TreeNode(9))
             )
        ),
        expected: 24
    },
    {
        root: new TreeNode(1),
        expected: 1
    },
    {
        root: null,
        expected: 0
    },
    {
        root: new TreeNode(1, new TreeNode(2), new TreeNode(3)),
        expected: 5
    },
    {
        root: new TreeNode(1,
            new TreeNode(2, 
                new TreeNode(4, 
                    new TreeNode(7))), 
            new TreeNode(3,
                new TreeNode(5,
                    new TreeNode(8)), 
                new TreeNode(6,
                    null, 
                    new TreeNode(9))))
        ,
        expected: 24
    }
];

// Execute test cases
testCases.forEach((test, index) =&gt; {
    const result = deepestLeavesSum(test.root);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. Contact me at &lt;<a href="mailto:home@DESKTOP-FKN1U1P">home@DESKTOP-FKN1U1P</a>&gt;
<script src="/static/highlightjs/highlight.min.js"></script>
<script>
  document.addEventListener('DOMContentLoaded', (event) => {
    document.querySelectorAll('pre.src').forEach((block) => {
      hljs.highlightElement(block);
    });
  });
</script>
</div>
</body>
</html>
